# Pandas

## Import stuff

In [4]:
import pandas as pd
import numpy as np

## Series Datastructure

Series is the most basic pandas datastructure. Collection of Series make a dataframe.

In [13]:
sales = np.random.normal(600,50,7)
days = ['sun','mon', 'tue', 'wed', 'thu', 'fri', 'sat']

sales_data = pd.Series(sales, index = days)

sales_data

sun    576.331224
mon    600.179140
tue    596.414528
wed    571.629172
thu    564.461197
fri    580.634509
sat    570.955895
dtype: float64

## Querying a Series

Use iloc for querying with index.
Use loc for querying with key label.

Use Shortcuts carefully. Don't use them when label is a number.

In [14]:
sales_data.iloc[1] # Monday sales

600.17914038158449

In [15]:
# Or
sales_data.loc['mon']

600.17914038158449

In [16]:
#Also,
sales_data['mon']

600.17914038158449

In [17]:
sales_data[1]

600.17914038158449

## Some quick operations:

In [19]:
total_sales = np.sum(sales_data)
avg_sales = np.mean(sales_data)
std_sales = np.std(sales_data)

print("Total Sales: ", total_sales)
print("Mean Sales: ", avg_sales)
print("Standard Deviation: ", std_sales)

Total Sales:  4060.6056643014995
Mean Sales:  580.0865234716427
Standard Deviation:  12.442815364467766

Much faster and cleaner than doing it iteratively. Let's create a fairly big dataset and compare the times.

In [20]:
big_dataset = np.random.randn(10000)

In [21]:
%%timeit -n 100

summary = 0
for i in big_dataset:
    summary+=i

1.26 ms ± 246 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [22]:
%%timeit -n 100

np.sum(big_dataset)

21.5 µs ± 8.17 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

Well, that's something to take away.

## Dataframe Datastructure

In [25]:
num_customers = pd.Series(np.random.randint(8,12,7), 
                          index = days)

df = pd.DataFrame([sales_data, num_customers], index = ['Total Sales', 'Customers'])

df

,sun,mon,tue,wed,thu,fri,sat
Total Sales,576.331224,600.17914,596.414528,571.629172,564.461197,580.634509,570.955895
Customers,10.000000,10.00000,8.000000,8.000000,9.000000,8.000000,10.000000

In [26]:
df = df.T
df

     Total Sales  Customers
sun   576.331224       10.0
mon   600.179140       10.0
tue   596.414528        8.0
wed   571.629172        8.0
thu   564.461197        9.0
fri   580.634509        8.0
sat   570.955895       10.0

In [27]:
df.loc['sun']

Total Sales    576.331224
Customers       10.000000
Name: sun, dtype: float64

In [28]:
df.loc['sun', 'Customers']

10.0

In [32]:
weekends = ['sun', 'sat']
weekday_sales = df.drop(weekends)
weekday_sales

     Total Sales  Customers
mon   600.179140       10.0
tue   596.414528        8.0
wed   571.629172        8.0
thu   564.461197        9.0
fri   580.634509        8.0

Call rows using loc and iloc. You can call columns kinda directly.

In [35]:
df['Total Sales']

sun    576.331224
mon    600.179140
tue    596.414528
wed    571.629172
thu    564.461197
fri    580.634509
sat    570.955895
Name: Total Sales, dtype: float64

In [37]:
#or

df.loc[:,'Total Sales']

sun    576.331224
mon    600.179140
tue    596.414528
wed    571.629172
thu    564.461197
fri    580.634509
sat    570.955895
Name: Total Sales, dtype: float64

Adding rows and columns is simple too.

In [39]:
df['Profits'] = np.random.normal(50,20,7)
df

     Total Sales  Customers    Profits
sun   576.331224       10.0  64.693609
mon   600.179140       10.0  26.649496
tue   596.414528        8.0  34.153227
wed   571.629172        8.0  72.668832
thu   564.461197        9.0  42.855050
fri   580.634509        8.0  40.584386
sat   570.955895       10.0  49.246942

## Using read_csv and preliminary cleaning of data

In [42]:
goop = pd.read_csv('goop.csv')
goop.head()

                            Sample goop of data junk     Unnamed: 1 Unnamed: 2
0                                                NaN            NaN        NaN
1  This data is exclusively for cleaning purpses ...            NaN        NaN
2                                       Index cos y0  Numbers cosy0       Goop
3                                                  1            one          1
4                                                  2            two          1

Alright. Something's clearly wrong here. Let's look at the csv file.

In [43]:
!cat goop.csv

Sample goop of data junk,,
,,
This data is exclusively for cleaning purpses only.,,
Index cos y0,Numbers cosy0,Goop
1,one,1
2,two,1
3,three,2
4,four ,3
5,five,5
6,six,2
7,seven,2
8,eight ,3
9,nine,4
10,ten ,6
11,eleven,3
12,twelve,3
13,thirteen,4
14,fourteen,5
15,fifteen,7
16,sixteen,4
17,seventeen,4
18,eighteen,5
19,nineteen,6
20,twenty,8

Right. We need to cut out the descriptions, set the index as col 0 and edit the column names.

In [81]:
goop = pd.read_csv('goop.csv', index_col = 0, skiprows=3)

goop.columns

Index(['Numbers cosy0', 'Goop'], dtype='object')

In [82]:
goop.rename?

In [86]:
for col in goop.columns:
    goop.rename(columns = {col:col.split(' ')[0]}, inplace = True)
    
goop.index.name = 'Index'
goop.head()

      Numbers  Goop
Index
1         one     1
2         two     1
3       three     2
4       four      3
5        five     5

## Querying Dataframes

Alright. Let's go back to our sales data now. Nobody wants to deal with goop.

Querying is pretty easy with pandas. You can either use .where() or a cool shortcut.

In [87]:
df.head()

     Total Sales  Customers    Profits
sun   576.331224       10.0  64.693609
mon   600.179140       10.0  26.649496
tue   596.414528        8.0  34.153227
wed   571.629172        8.0  72.668832
thu   564.461197        9.0  42.855050

In [90]:
lots = df.where(df['Customers']>8)
lots

     Total Sales  Customers    Profits
sun   576.331224       10.0  64.693609
mon   600.179140       10.0  26.649496
tue          NaN        NaN        NaN
wed          NaN        NaN        NaN
thu   564.461197        9.0  42.855050
fri          NaN        NaN        NaN
sat   570.955895       10.0  49.246942

In [92]:
lots.dropna()

     Total Sales  Customers    Profits
sun   576.331224       10.0  64.693609
mon   600.179140       10.0  26.649496
thu   564.461197        9.0  42.855050
sat   570.955895       10.0  49.246942

In [94]:
#or [Cool shortcut]

lots = df[df['Customers']>8]
lots

     Total Sales  Customers    Profits
sun   576.331224       10.0  64.693609
mon   600.179140       10.0  26.649496
thu   564.461197        9.0  42.855050
sat   570.955895       10.0  49.246942